/***
 Дан набор ненулевых целых чисел; признак его завершения — число 0.
 Вывести сумму всех положительных четных чисел из данного набора.
 Если требуемые числа в наборе отсутствуют, то вывести 0.
 */
let sum = 0;
let n = +prompt(`Введіть кількість елементів`);
let i = 1;
document.write("Список парних чисел: ");
while (i <= n) {
    let num = +prompt(`Введіть ненульове число`);

    if (num % 2 == 0) {
        document.write(num);
        sum += num;
        document.write(";");
    }

    if (num == 0) {
        alert("Ви ввели число 0. Почніть спочатку")
        break;
    }
    i++;
}
document.write("<br>");
document.write("Сума всіх парних чисел =", sum);









