/***
 Дано целое число K и набор ненулевых целых чисел; признак его завершения — число 0.
 Вывести номер первого числа в наборе, большего K. Если таких чисел нет, то вывести 0
 */
let n = +prompt(`Введіть кількість елементів`);
let i = 0;
let k = +prompt(`Введіть ціле число (К)`);
document.write("Список набору введених чисел: ");

while (i <= n) {
    let num = +prompt(`Введіть ненульове число`);
    i++;
    document.write(num + ",");

    if (num > k){
        num = i;
        document.write ("<br>")
        document.write ("Індекс першого числа, більшого за К: ", num);
        break //змогла тільки в такий спосіб вирішити завдання
    }
}



