/***
 Дан набор ненулевых целых чисел; признак его завершения — число 0. Вывести количество чисел в наборе.
 */
let n = +prompt(`Введіть кількість елементів`);
let i = 1;
let k = 0;
while (i <= n) {
    let num = +prompt(`Введіть ненульове число`);
    i++;
    k+=1

    if (num < 0){
       alert("Введіть число більше нуля")
    }

    if (num == 0){
        alert("Ви ввели число 0. Почніть спочатку")
        break;
    }
}
document.write ("Кількість чисел в наборі: ");
document.write (k);







