/***
 Дано целое число K и набор ненулевых целых чисел; признак его завершения — число 0.
 Вывести количество чисел в наборе, меньших K
 */
let n = +prompt(`Введіть кількість елементів`);
let i = 1;
let q = 0;
let k = +prompt(`Введіть будь-яке число (К)`);
while (i <= n) {
    let num = +prompt(`Введіть ненульове число`);
    i++;
    if (k > num) {
        q += 1;
    }

    if (num == 0) {
        alert("Ви ввели число 0. Почніть спочатку")
        break;
    }
}
document.write("Кількість чисел менших за число К =");
document.write(q);















