/***
 Дано целое число N и набор из N целых чисел.
 Вывести в том же порядке номера всех нечетных чисел из данного набора и количество K таких чисел
 */
let n = +prompt(`Введіть кількість елементів`);
let i = 1;
let k = 0;
document.write("Парні числа з набору:");
while (i <= n) {
    num = +prompt("Введіть цілі числа більше нуля",);

    if (num % 2 != 0) {
        k += 1;
        document.write("<br>");
        document.write(num);
        document.write("<br>");
    }

    i++;
}
document.write("Кількість парних чисел:", k);
