/**
Integer15◦. Дано трехзначное число. Вывести число, полученное при переста-
новке цифр сотен и десятков исходного числа (например, 123 перейдет в
213).
*/
function integer15() {
	let num = +prompt("Уведіть трицифрове число:");
	if (num < 99 || num > 999) {
		alert("Уведене число повинне бути трицифрове.");
		return;
	}
	
	/*
	k = 100c + 10b + a;
	k' = 100b + 10c + a;
	a, b, c -> {0, 1, 2, 3, 4, 5, 6, 7, 8, 9} (1)
	
	floor(k / 100) = floor( (100c + 10b + a) / 100 ) =
		= floor(c + 0,1b + 0,01a);
	(1) => floor(c + 0,1b + 0,01a) = c => floor(k / 100) = c (2)
	
	k % 100 = (100c + 10b + a) % 100 = 100c % 100 + 10b % 100 + a % 100 =
		= 0c + 10b + a = 10b + a;
	floor ( (10b + a) / 10 ) = floor(b + 0,1a);
	(1) => floor(b + 0,1a) = b => floor( (k % 100) / 10 ) = b (3)
	
	k % 10 = (100c + 10b + a) % 10 = 100c % 10 + 10b % 10 + a % 10 = 0c + 0b + a = a;
	k % 10 = a (4)
	
	(2), (3), (4) => k' = 100b + 10c + a = 100 * floor( (k % 100) / 10 ) + 10 * floor(k / 100) + k % 10
	*/
	let reversed = Math.floor( (num % 100) / 10 ) * 100 +
		Math.floor(num / 100) * 10 +
		num % 10;
	
	alert(`Перевернуте число (поміняно десятки й сотні): ${reversed}.`);
}

/**
Integer27◦. Дни недели пронумерованы следующим образом: 1 — понедель-
ник, 2 — вторник, . . . , 6 — суббота, 7 — воскресенье. Дано целое число K,
лежащее в диапазоне 1–365. Определить номер дня недели для K-го дня
года, если известно, что в этом году 1 января было субботой.
*/
function integer27() {
	weekdays = [
		"понеділок",
		"вівторок",
		"середа",
		"четвер",
		"п'ятниця",
		"субота",
		"неділя"
	]
	
	let offset = 5;
	
	let day = +prompt("Уведіть число - день року:");
	if (day < 1 || day > 365) {
		alert("Уведене число повинне бути в межах [1; 365].");
		return;
	}
	
	// оскільки a % a = 0, то оброблюємо неділю окремо
	let weekday_num = ( ((day + offset) % 7 == 0)? 7 : (day + offset) % 7 ) - 1;
	let weekday = weekdays[weekday_num];
	
	alert(`Відповідний день тижня - ${weekday}.`);
}

/**
Integer30. Дан номер некоторого года (целое положительное число). Опреде-
лить соответствующий ему номер столетия, учитывая, что, к примеру, на-
чалом 20 столетия был 1901 год.
*/
function integer30() {
	let year = +prompt("Уведіть рік:");
	if (year < 1) {
		alert("Число року повинно бути більшим за нуль.");
		return;
	}
	
	let centery = Math.floor( (year - 1) / 100 ) + 1;
	
	alert(`Відповідне ${year}-му року століття - ${centery}.`);
}

//integer15();
//integer27();
integer30();