/**
Integer15◦. Дано трехзначное число. Вывести число, полученное при переста-
новке цифр сотен и десятков исходного числа (например, 123 перейдет в
213).
*/
function integer15() {
	let num = +prompt("Уведіть трицифрове число:");
	if (num < 99 || num > 999) {
		alert("Уведене число повинне бути трицифрове.");
		return;
	}
	
	/*
	k = 100c + 10b + a;
	k' = 100b + 10c + a;
	a, b, c -> {0, 1, 2, 3, 4, 5, 6, 7, 8, 9} (1)
	
	floor(k / 100) = floor( (100c + 10b + a) / 100 ) =
		= floor(c + 0,1b + 0,01a);
	(1) => floor(c + 0,1b + 0,01a) = c => floor(k / 100) = c (2)
	
	k % 100 = (100c + 10b + a) % 100 = 100c % 100 + 10b % 100 + a % 100 =
		= 0c + 10b + a = 10b + a;
	floor ( (10b + a) / 10 ) = floor(b + 0,1a);
	(1) => floor(b + 0,1a) = b => floor( (k % 100) / 10 ) = b (3)
	
	k % 10 = (100c + 10b + a) % 10 = 100c % 10 + 10b % 10 + a % 10 = 0c + 0b + a = a;
	k % 10 = a (4)
	
	(2), (3), (4) => k' = 100b + 10c + a = 100 * floor( (k % 100) / 10 ) + 10 * floor(k / 100) + k % 10
	*/
	let reversed = Math.floor( (num % 100) / 10 ) * 100 +
		Math.floor(num / 100) * 10 +
		num % 10;
	
	alert(`Перевернуте число (поміняно десятки й сотні): ${reversed}.`);
}

integer15();